/**
 * 12.2 location对象
 * 
 * location是最有用的BOM对象之一, 提供了当前窗口中加载文档的信息, 以及通常的导航功能.
 * 这个对象独特的地方在于, 它既是window的属性, 也是document的属性.
 * 也就是说, window.location和document.location指向同一个对象.
 */
console.log(window.location === document.location);

/**
 * location对象不仅保存着当前加载文档的信息, 也保存着把URL解析为离散片段后能够通过属性访问的信息.
 * 
 * 假设浏览器当前加载的URL是http://foouser:barpassword@www.wrox.com:80/WileyCDA/?q=javascript#contents
 * location对象的内容如下:
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.hash     | "#contents"                                                                  | URL散列值, 井号后跟零个或多个字符
 * |                   |                                                                              | 如果没有则为空字符串
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.host     | "www.wrox.com:80"                                                            | 服务器名及端口号
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.hostname | "www.wrox.com"                                                               | 服务器域名
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.href     | "http://foouser:barpassword@www.wrox.com:80/WileyCDA/?q=javascript#contents" | 当前加载页面的完整URL
 * |                   |                                                                              | location的toString()方法返回这个值
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.pathname | "/WileyCDA"                                                                  | URL中的路径或文件名
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.port     | "80"                                                                         | 请求的端口号
 * |                   |                                                                              | 如果URL中没有端口号, 则返回空字符串
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.protocol | "http:"                                                                      | 页面使用的协议
 * |                   |                                                                              | 通常是"http:"或"https:"
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.search   | "?q=javascript"                                                              | URL的查询字符串, 这个字符串以问好开头
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.username | "foouser"                                                                    | 域名前指定的用户名
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.password | "barpassword"                                                                | 域名前指定的密码
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 * | location.origin   | "http://www.wrox.com"                                                        | URL源地址, 只读
 * |-------------------|------------------------------------------------------------------------------|---------------------------------|
 */